Revit 2027 API
ReferenceIntersector.SetTargetElementIds Method
 Sets the set of ElementIds to test from in intersection testing.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public void SetTargetElementIds(
	ICollection<ElementId> elementIds
)
Public Sub SetTargetElementIds (
	elementIds As ICollection(Of ElementId)
)
public:
void SetTargetElementIds(
	ICollection<ElementId^>^ elementIds
)
member SetTargetElementIds :
        elementIds : ICollection<ElementId> -> unit
Parameters
elementIds ICollection<ElementId>
 The target ElementIds.
Exceptions
Exception | Condition
ArgumentNullException |  A non-optional argument was null
See Also
Reference
ReferenceIntersector Class
Autodesk.Revit.DB Namespace